Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་འཛིན་ཆོས་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལུས་འདི་བོར་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་པའི་དྲན་པ་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have four qualities will have unbroken mindfulness from the point that they relinquish this body until they awaken to unsurpassed and perfect buddhahood.

source: དགེ་བ་དང་མི་དགེ་བའི་ཆོས་ལ་ཤིན་ཏུ་རྟོགས་པ་དང་། དྲན་པ་དང་ཤེས་རབ་ཕུལ་དུ་གྱུར་པ་དང་། སེམས་ཀྱི་སྒྲིབ་པ་ལྔ་ཡོངས་སུ་སྤངས་པ་དང་། ནམ་དུ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དྲན་པ་མི་ཉམས་པ་དང་བཞིའོ། །
en: Knowledge of virtuous and nonvirtuous phenomena, excellent mindfulness and insight, abandonment of the five mental obscurations, and never allowing one’s mindfulness of unsurpassed and perfect awakening to wane.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལུས་འདི་བོར་ནས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་པའི་དྲན་པ་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have four additional qualities will have unbroken mindfulness from the point that they relinquish this body until they awaken to unsurpassed and perfect buddhahood.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་ཤིན་ཏུ་ནན་ཏན་བྱེད་པ་དང་། རྣམ་པར་འབྱེད་པའི་ཤེས་རབ་ལ་ཤིན་ཏུ་ནན་ཏན་བྱེད་པ་དང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་ཐོག་མར་ཤེས་རབ་གཏོང་བ་དང་། ངེས་པའི་ཤེས་རབ་ཁོང་དུ་ཆུད་པ་དང་བཞིའོ། །
en: Strong pursuit of the four applications of mindfulness, strong pursuit of discerning insight, placing insight at the forefront of all absorptions, and mastering definitive insight.

source: བཞི་གང་ཞེ་ན་
en: What are these four?

source: གཟུངས་ཀྱི་སྒོ་ཐོབ་པ་དང་། མ་སྐྱེས་པའི་ཡེ་ཤེས་སྒོམ་པ་དང་། ཟད་པའི་ཡེ་ཤེས་ལ་འཇུག་པ་དང་། འགོག་པའི་ཡེ་ཤེས་རྟོགས་པར་བྱ་བ་དང་བཞིའོ། །
en: Attainment of the dhāraṇī gateways, cultivation of unborn wisdom, understanding the wisdom of exhaustion, and realization of the wisdom of cessation.

source: བྱམས་སྡང་མེད་པར་བྱ་བ་དང་། འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་མི་ཆགས་པ་དང་། འདུས་མ་བྱས་པའི་ཡེ་ཤེས་རྟོགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་དུ་ཕྱིན་པར་བྱེད་པའོ། །
en: Eliminating desire and aversion, being free from attachment to any conditioned phenomenon, realization of unconditioned wisdom, and arriving at the domain of the thus-gone ones.

source: འཇིག་རྟེན་འཛིན་འདི་དག་ནི་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལུས་འདི་བོར་ནས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་པའི་དྲན་པ་དང་ལྡན་པར་འགྱུར་རོ། །
en: Lokadhara, bodhisattva great beings who have these four qualities will have unbroken mindfulness from the point that they relinquish this body until they awaken to unsurpassed and perfect buddhahood.”

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་ཆོས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་རྣམ་པ་ལྔ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོན་ཏན་གོང་མའི་རྣམས་རྫོགས་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have five types of wisdom strength that purify phenomena will perfect the higher virtues.

source: ལྔ་གང་ཞེ་ན།
en: What are these five?

source: ཤིན་ཏུ་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སྨོན་ལམ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དགེ་བའི་རྩ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སྔོ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྔའོ། །
en: The wisdom strength that purifies motivation, the wisdom strength that purifies aspirations, the wisdom strength that purifies roots of virtue, the wisdom strength that purifies dedication, and the wisdom strength that purifies karmic obscurations.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་རྣམ་པ་ལྔ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོན་ཏན་གོང་མའི་རྣམས་རྫོགས་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have an alternate set of five types of purificatory wisdom strength will perfect the higher virtues.

source: སྤྱོད་ལམ་གྱི་གནས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དྲན་པ་དང་ལྡན་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སྦྱོར་བའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སེམས་ལ་དམིགས་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མཚན་ཉིད་ལ་དམིགས་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྔའོ། །
en: The wisdom strength that purifies conduct, the wisdom strength that purifies mindfulness, the wisdom strength that purifies practice, the wisdom strength that purifies apprehension of sentient beings, and the wisdom strength that purifies apprehension of characteristics.

source: གཏོང་བའི་སེམས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སེམས་ཅན་ལ་ཕན་པ་དང་བདེ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བྱམས་པ་ཆེན་པོ་བསྐྱེད་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་བསྐྱེད་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྔའོ། །
en: The wisdom strength that purifies a detached attitude, the wisdom strength that purifies bringing benefit and happiness to beings, the wisdom strength that purifies the development of great love, the wisdom strength that purifies the development of great compassion, and the wisdom strength that purifies the development of great joy and equanimity.

source: ཚུལ་ཁྲིམས་སྲུང་བའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཚུལ་ཁྲིམས་བསྲུང་བ་ལ་མ་ཆགས་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བཟོད་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བཟོད་པ་ལ་མ་ཆགས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མང་དུ་ཐོས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྔའོ། །
en: The wisdom strength that purifies the observance of discipline, the wisdom strength that purifies nonattachment to the observance of discipline, the wisdom strength that purifies patience, the wisdom strength that purifies nonattachment to patience, and the wisdom strength that purifies learnedness.

source: ལྷག་པའི་བརྩོན་འགྲུས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བརྩོན་འགྲུས་ལེན་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བསམ་གཏན་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བསམ་གཏན་གྱི་ཐབས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཞི་གནས་དང་ལྷག་མཐོང་གི་ཐབས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྔའོ། །
en: The wisdom strength that purifies higher diligence, the wisdom strength that purifies the acquisition of diligence, the wisdom strength that purifies concentration, the wisdom strength that purifies the means of concentration, and the wisdom strength that purifies the means of tranquility and special insight.

source: ཤེས་རབ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མང་དུ་ཐོས་པའི་ངེས་པར་སྦྱོར་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདའ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཤེས་རབ་དང་ཐབས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྔའོ། །
en: The wisdom strength that purifies insight, the wisdom strength that purifies the attainment of erudition, the wisdom strength that purifies the worldly and transcendent, the wisdom strength that purifies insight and means, and the wisdom strength that purifies the conditioned and the unconditioned.

source: ཐབས་ལ་རྟོག་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། རིག་པ་དང་རྣམ་པར་གྲོལ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མ་སྐྱེས་པའི་མཚན་ཉིད་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མཚན་ཉིད་གཅིག་པ་དང་མཚན་ཉིད་མེད་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དོན་དམ་པ་དང་ཀུན་རྫོབ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་སོ། །
en: The wisdom strength that purifies the understanding of means, the wisdom strength that purifies knowledge and liberation, the wisdom strength that purifies the characteristic of the unborn, the wisdom strength that purifies the singularity of characteristics and the absence of characteristics, and the wisdom strength that purifies the relative and the ultimate.

source: འཇིག་རྟེན་འཛིན་དེ་དག་ནི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་རྣམ་པ་ལྔ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མྱུར་དུ་ཡོན་ཏན་གོང་མའི་རྣམས་རྫོགས་པ་ཡིན་ནོ། །
en: Lokadhara, bodhisattva great beings who have these five types of purificatory wisdom strength will perfect the higher virtues.

source: འཇིག་རྟེན་འཛིན་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དེ་དག་བསྒོམ་པ་ལ་ཤིན་ཏུ་བརྩོན་པར་བྱའོ། །
en: Therefore, Lokadhara, bodhisattva great beings must endeavor greatly to cultivate these purificatory wisdom strengths.”

source: འཇིག་རྟེན་འཛིན་ཆོས་རྣམ་པ་གསུམ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ལ་བརྩོན་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have three qualities will endeavor in the purificatory wisdom strength.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: མོས་པ་དང་། བརྩོན་འགྲུས་དང་། བག་བྱེད་པའོ། །
en: Interest, diligence, and carefulness.

source: ཆོས་རྣམ་པ་འདི་གསུམ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོན་ཏན་ཐམས་ཅད་རྫོགས་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ལ་བརྩོན་པ་ཡིན་ནོ། །
en: Bodhisattva great beings who have these three will endeavor in the wisdom strength that purifies the entirety of virtues.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: འཇིག་རྟེན་འཛིན། མོས་པ་དང་། བརྩོན་འགྲུས་དང་། བག་བྱེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་ཡིན་པས་
en: Lokadhara, interest, diligence, and carefulness are the roots of all qualities. “Thus,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ལ་ནན་ཏན་བྱེད་པ་ནི་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་ཏེ
en: bodhisattva great beings who apply themselves to the purificatory wisdom strength will swiftly attain omniscient wisdom.

source: བརྩོན་འགྲུས་ལས་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ། །
en: They will be called those who do not regress from diligence.

source: ཆོས་ལས་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ། །
en: They will be called those who do not regress from the Dharma.

source: ཡོན་ཏན་དེ་ཉིད་མྱུར་དུ་འཕེལ་ཞིང་སྐྱེ་བའམ་འཐོབ་པར་འགྱུར་ལ།
en: They will also swiftly attain an exponential growth in those very virtues.

source: ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱང་མྱུར་དུ་འཐོབ་བོ། །
en: They will also swiftly achieve the wisdom strength that purifies all qualities.

source: འཇིག་རྟེན་འཛིན་གང་ཟག་གང་ཞིག་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཐོབ་པ་ནི་འཇིག་རྟེན་གྱི་བསོད་ནམས་ཀྱི་ཞིང་ཞེས་བྱའོ། །
en: Lokadhara, any person who achieves the wisdom strength that purifies all qualities in this manner is said to be a field of merit for the world.

source: གང་ཟག་དེ་ནི་ངའི་འོག་ཏུ་མཆོད་པའི་རྙེད་པ་ཞུ་བ་ཞེས་བྱའོ། །
en: It is said that this person will consume the offering goods after me.

source: གང་ཟག་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་གྱི་གནས་སུ་ཕྱིན་པ་ཞེས་བྱའོ། །
en: It is said that this person will arrive at the domain of the thus-gone ones.

source: གང་ཟག་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་རྟོགས་པ་ཞེས་བྱའོ། །
en: It is said that this person will realize the qualities of the thus-gone ones.

source: གང་ཟག་དེས་རིང་པོ་མི་ཐོགས་པར་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཆུད་པར་འགྱུར་རོ། །
en: Before long, such a person will master the wisdom of the thus-gone ones.

source: འཇིག་རྟེན་འཛིན་ང་སྔོན་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པའི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན།
en: “Lokadhara, many countless immeasurable eons ago, as I was practicing bodhisattva conduct,

source: སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་ང་ལ་ཁྱོད་བསྐལ་པ་གྲངས་མེད་པ་འདས་ནས་མངོན་པར་འཚང་རྒྱའོ་ཞེས་ལུང་བསྟན་ཏེ།
en: Buddha Dīpaṅkara prophesied to me, ‘You will fully awaken to buddhahood after countless eons.’

source: ངས་དེའི་ཚེ་ཉིད་ན་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དེ་དག་ཀུན་ཤེས་པར་གྱུར་ཏོ། །
en: At that very moment, I understood all these purificatory wisdom strengths.

source: འཇིག་རྟེན་འཛིན་གང་ཟག་གང་ཞིག་ཆོས་ཐམས་ཅད་ལ་དེ་ལྟ་བུའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྡན་པར་འགྱུར་བ་ནི། གང་ཟག་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པ་ན་ད་ལྟར་ངས་ཇི་ལྟར་ཐོབ་པ་བཞིན་ནོ། །
en: Lokadhara, any person who has such purificatory wisdom strength will attain unexcelled, perfect, and complete awakening, just as I have attained it now.

source: གང་ཟག་དེས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་བའང་ངས་ཇི་ལྟར་བསྐོར་བ་བཞིན་ནོ། །
en: Such a person will also turn the wheel of Dharma, just as I do now.

source: གང་ཟག་དེས་སེང་གེའི་སྒྲ་སྒྲོག་པར་འགྱུར་བའང་ངས་ཇི་ལྟར་སྒྲ་བསྒྲགས་པ་བཞིན་ནོ། །
en: That person will roar the lion’s roar, just as I roar it.

source: གང་ཟག་དེས་རང་བཞིན་གྱིས་ཆོས་ཐམས་ཅད་ལ་དབང་བ་དང་སྟོབས་ཐོབ་པ་ཡང་ད་ལྟར་གྱི་ང་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: That person will naturally have power and strength over all phenomena just as I do now.

source: འཇིག་རྟེན་འཛིན་ཁྱོད་ཀྱིས་ཀྱང་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་འདི་བསྒོམ་པ་ལ་བརྩོན་པར་བྱས་ན་
en: Lokadhara, if you have exerted yourself in the cultivation of this purificatory wisdom strength,

source: རིང་པོར་མི་ཐོགས་པར་ཡེ་ཤེས་དང་ཤེས་རབ་ཐམས་ཅད་ལྷུན་གྱིས་གྲུབ་པར་འགྱུར་རོ། །
en: you will spontaneously accomplish all wisdom and insight before long.

source: འཇིག་རྟེན་འཛིན་སྔོན་བསྐལ་པ་གྲངས་མེད་ཚད་མེད་པ་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན། བཅོམ་ལྡན་འདས་ཡེ་ཤེས་མཐོ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་ཞིང་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Lokadhara, countless immeasurable eons ago, the blessed one known as King of Lofty Wisdom appeared in the world. He was a thus-gone one, a learned and virtuous one, a blissful one, a knower of the world, an unsurpassed being, a charioteer who guides beings, a teacher of gods and humans, and a blessed buddha.

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་ཡེ་ཤེས་མཐོ་བའི་རྒྱལ་པོ་དེ་ལ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཚད་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཚད་མེད་པ་ཡོད་དོ། །
en: Lokadhara, the blessed one King of Lofty Wisdom had an immeasurable saṅgha of hearers and an immeasurable saṅgha of bodhisattvas.

source: དེ་ཡང་བཅོམ་ལྡན་འདས་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་རྒྱུ་དང་རྐྱེན་གྱི་དབང་གིས་སོ། །
en: This was due to the causes and conditions of this Blessed One’s past aspirations.

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་མཐོ་བའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ངན་སོང་གསུམ་གྱི་མིང་ཡང་མི་གྲག་སྟེ།
en: Even the words three lower realms were unheard of in the blessed one King of Lofty Wisdom’s buddha realm.

source: སེམས་ཅན་དེ་དག་ཀྱང་སྡུག་བསྔལ་ཡོད་པར་མི་ཚོར་ཞིང་།
en: No one there had experienced any suffering;

source: མཐར་བདེ་བ་དང་སྐྱིད་པ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པས་འདོད་པ་ཡོངས་སུ་སྤངས་པ་མང་སྟེ། སྒྲིབ་པ་ལྔ་ཡང་རབ་ཏུ་བཅིལ་བ་ཤ་སྟག་གོ། །
en: all in all, everyone there had such an abundance of happiness and joy that they were mostly free of desire, as the five obscurations were eliminated.

source: སེམས་ཅན་དེ་དག་དེ་ལྟར་ཡོངས་སུ་དག་པའི་བདེ་བ་དང་ལྡན་པ་ནི་བསམ་གཏན་བཞི་པའི་བདེ་བ་ཐོབ་པ་བཞིན་ནོ། །
en: These beings had such pure happiness that it was as if they had attained the bliss of the four concentrations.

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་མཐོ་བའི་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཁྲི་ཕྲག་ཁྲག་ཁྲིག་སྙེད་དོ། །
en: The lifespan of the blessed one King of Lofty Wisdom was one quadrillion eons.

source: དེའི་ཚེ་ན་འཇིག་རྟེན་དེའི་རྒྱལ་པོ་ཡང་དེ་བཞིན་གཤེགས་པས་མཛད་དེ།
en: The Thus-Gone One acted as the king of the world at that time.

source: དེ་མ་ཡིན་པའི་རྒྱལ་པོ་གཞན་མེད་པས་ཡུལ་དེའི་སེམས་ཅན་དག་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བརྗོད་དོ། །
en: As there was no other king, the beings of that realm called the Blessed One their Dharma King .

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་མཐོ་བའི་རྒྱལ་པོ་དེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅོད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མགུ་བར་འགྱུར་བ་ཞེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྟོན་ཏོ། །
en: The blessed one King of Lofty Wisdom taught the bodhisattvas a discourse from the Bodhisattva Collection called Countering the Doubts and Pleasing the Minds of All Beings .

source: དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་བཤད་པ་ཐོས་ནས་
en: When five hundred of the bodhisattvas heard this description of the bodhisattvas’ purificatory wisdom strength,

source: འདི་ལྟ་བུའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་བསྐྱེད་པར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ། ནམ་འཚོའི་བར་དུ་འདུག་པའི་སེམས་མི་སྐྱེད་པ་དང་། ནམ་འཚོའི་བར་དུ་གོས་སུ་འདུ་ཤེས་པ་མི་སྐྱེད་པ་དང་། ནམ་འཚོའི་བར་དུ་བདག་ཏུ་འདུ་ཤེས་པ་དང་། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང་། སྐྱེས་པ་དང་བུད་མེད་དུ་འདུ་ཤེས་པ་མི་སྐྱེད་པ་དང་། ནམ་འཚོའི་བར་དུ་ཟས་མང་དུ་མི་ཟ་ཞིང་འདི་ལྟ་བུའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ལ་ནན་ཏན་བྱེད་དོ། །
en: they generated such strength of diligence that for the rest of their lives, they did not develop the intent to sit; did not develop notions about clothing; did not develop notions about themselves, other beings, men, or women; and did not eat too much food. Rather, they only exerted themselves in this purificatory wisdom strength.

source: བརྩོན་འགྲུས་ལ་རབ་ཏུ་འབད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་པོ་དེ་དག་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱི་རྒྱུ་དང་རྐྱེན་གྱིས་ཚེ་འཕོས་ནས་
en: When these five hundred bodhisattvas who had exerted themselves so diligently passed away,

source: ཐམས་ཅད་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཁྲི་ཕྲག་བཅུ་འདས་པའི་ཕ་རོལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེས་སོ། །
en: they were later born in a buddha realm one hundred thousand buddha realms to the east of here, due to the causes and conditions of their roots of virtue.

source: དེར་སྐྱེས་ནས་ཆོས་དེ་ལ་ནན་ཏན་བྱས་པས་
en: Once born there, they exerted themselves in this teaching, and

source: རིང་པོ་མི་ཐོགས་པར་སྔོན་གྱི་གནས་དྲན་ཏེ་དབང་པོ་རྣོན་པོར་གྱུར་ཏོ། །
en: before long they remembered their past lives and gained sharp faculties.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཚད་མེད་པའི་མེ་ཏོག་བརྩེགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་བཞུགས་ཏེ།
en: In that buddha realm is a thus-gone one named King of Immeasurable Stacked Flowers.

source: འཚོ་སྐྱོང་ཞིང་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: He is still alive and teaching the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལོ་བཅུ་དྲུག་ལོན་ནས། བཅོམ་ལྡན་འདས་ཚད་མེད་པའི་མེ་ཏོག་བརྩེགས་པའི་རྒྱལ་པོའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: When they were sixteen years old, these bodhisattvas received ordination in the teachings of the blessed one King of Immeasurable Stacked Flowers.

source: ལོ་ཁྲི་ཕྲག་དྲུག་ཅུའི་བར་དུ་གཞོན་ནུར་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིང་དེ་ལྟ་བུའི་བརྩོན་འགྲུས་ལ་ནན་ཏན་བྱེད་དོ། །
en: For six hundred thousand years, they practiced pure conduct as youths and exerted themselves in this type of diligence.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་པོ་དེ་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཁྲི་ཕྲག་ཉི་ཤུ་དང་ཕྲད་དེ།
en: “Lokadhara, in that fashion these five hundred bodhisattvas met two hundred thousand thus-gone ones, and

source: བཅོམ་ལྡན་འདས་དེ་དག་གི་སྤྱན་སྔར་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྩམས་པས་དྲན་པ་དང་། བདེ་བ་དང་། ཤེས་རབ་ཕུལ་དུ་གྱུར་པ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: by practicing diligence in their presence, gained supreme mindfulness, happiness, and insight.

source: ཐ་མ་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་སྟོབས་མཐོ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་ཕྲད་ནས་བཅོམ་ལྡན་འདས་དེས་ལུང་བསྟན་པ། ཁྱེད་བསྐལ་པ་ཁྲི་འདས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: Finally, they met the blessed one King of Lofty and Immeasurable Power, who gave them this prophecy: ‘After ten thousand eons, you will fully awaken to unsurpassed and perfect buddhahood.’

source: བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་བསྐལ་པ་ཁྲིའི་བར་དུ་སངས་རྒྱས་སྟོང་ཕྲག་གཉིས་དང་ཕྲད་ནས་
en: Throughout that ten-thousand-eon period, those five hundred bodhisattvas met two thousand buddhas.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་རྫོགས་ཏེ། བསྐལ་པ་གཅིག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །
en: In this way, they perfected the awakening of the buddhas, until finally, one eon, they fully awakened to unsurpassed and perfect buddhahood.

source: འཇིག་རྟེན་འཛིན་དེ་བས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འདོད་པ་དག་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ལ་དེ་ལྟར་མོས་པ་དང་། བརྩོན་འགྲུས་དང་། བག་བྱེད་པ་བསྐྱེད་པར་རིག་པར་བྱའོ། །
en: “Lokadhara, therefore one should know that bodhisattvas who want to swiftly attain unsurpassed and perfect awakening ought to develop such interest, diligence, and carefulness regarding the purificatory wisdom strength.

source: འཇིག་རྟེན་འཛིན་སངས་རྒྱས་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པའི་རྩ་བ་ནི་མོས་པ་དང་། བརྩོན་འགྲུས་དང་། བག་བྱེད་པ་དང་། གཞན་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་སུ་གྱུར་པའི་ཆོས་གང་སངས་རྒྱས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པར་བྱེད་པ་རྣམས་སོ། །
en: Lokadhara, interest, diligence, and carefulness, along with the factors of awakening, are the roots of attaining the unsurpassed and perfect awakening of the buddhas—they complete the qualities of buddhahood.

source: འཇིག་རྟེན་འཛིན་ངས་དེ་ལྟ་བུའི་བརྩོན་འགྲུས་ཀྱིས་སངས་རྒྱས་ཁྲི་ཕྲག་ཉི་ཤུ་དང་ཕྲད་དེ།
en: “Lokadhara, as I practiced such diligence, I met with two hundred thousand buddhas, and

source: སངས་རྒྱས་དེ་དག་གི་ཆོས་ཀྱང་སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་དྲན་པ་དང་ལྡན་པར་འགྱུར།
en: their teachings enabled me to recall all my past lives.

source: སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་སྔོན་གྱི་གནས་དྲན་པས་ཆོས་འདི་བསྒོམ་པ་ལ་བར་ཆད་མེད་དེ།
en: By remembering the circumstances of all my past lives, I eliminated obstacles to the cultivation of this teaching.

source: ངས་མོས་པ་དང་། བརྩོན་འགྲུས་དང་། བག་བྱས་པ་ལས་མ་ཉམས་པས་རྟག་ཏུ་མོས་པ་དང་། བརྩོན་འགྲུས་དང་། བག་ཡོད་པ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: Never letting my interest, diligence, and carefulness decline, my interest, diligence, and carefulness became continuous.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཐུགས་རྗེ་དང་བྱམས་པ་ཆེན་པོའི་ཐུགས་ཀྱིས་ཕྱོགས་བཞིར་གཟིགས་ནས་མངོན་པར་ཤེས་པའི་རྫུ་འཕྲུལ་གྱི་མཐུ་བསྟན་ཏེ།
en: The Blessed One then gazed into the four directions with his mind of great love and compassion and displayed the miraculous power of his extraordinary abilities.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཛམ་བུའི་གླིང་ཀུན་ཏུ་སྤྲུལ་པའི་སངས་རྒྱས་དག་བཞུགས་ཤིང་སེམས་ཅན་རྣམས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅོད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མགུ་བར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བའི་མདོ་སྟོན་པར་གྱུར་ཏོ། །
en: He emanated buddhas into all the Jambudvīpas of the great trichiliocosm, where they each taught the discourse from the Bodhisattva Collection called Countering the Doubts and Pleasing the Minds of All Beings .

source: གཞན་ཡང་རྫུ་འཕྲུལ་གྱི་མཐུས་འོད་མའི་ཚལ་གྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཀུན་ཀྱང་སྤྲུལ་པའི་སངས་རྒྱས་ཀྱིས་འཛམ་བུའི་གླིང་གང་བ་བཞུགས་ཤིང་སོ་སོ་ནས་དམ་པའི་ཆོས་སྟོན་པར་མཐོང་ནས
en: Furthermore, through his miraculous ability, the many assemblies in Veṇuvana were able to behold the emanated buddhas filling the Jambudvīpas, each teaching the Dharma, whereby

source: འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམས་རབ་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: all the assemblies were delighted.

source: འདུག་པ་ལས་ལངས་ནས་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ཏེ། འདི་སྐད་དུ་ངོ་མཚར་ཆེའོ། །
en: They rose from their seats, prostrated to the Buddha, and marveled,

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་མཐུ་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: “Blessed One, the miraculous ability of the blessed buddhas is unfathomable.

source: ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་ལྷུན་གྱིས་གྲུབ་བོ་ཞེས་སྨྲས་སོ། །
en: The immeasurable and unfathomable Dharma is spontaneously accomplished.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོ་རྣམས་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་དངོས་པོ་འདི་དག་ངོ་མཚར་ཆེ་བ་མ་ཡིན་ནོ། །
en: The Blessed One then addressed the myriad assemblies, “Noble children, the things revealed by the Thus-Gone One are not so remarkable.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཉིད་ཐུགས་སུ་ཆུད་པས་
en: Because the Thus-Gone One understands reality ,

source: བ་སྤུའི་ཁུང་བུ་གཅིག་ནས་ཀྱང་མངོན་པར་ཤེས་པའི་རྫུ་འཕྲུལ་གྱི་མཐུས་འོད་ཟེར་བཀྱེ་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བར་མཛད་ཅིང་ཆོས་ཀྱི་གསུང་སྒྲོགས་ཀྱང་བ་སྤུའི་ཁུང་བུ་གཅིག་ནས་བསྟན་པའི་བརྒྱ་སྟོང་གི་ཆ་གཅིག་ཙམ་ཡང་རྫོགས་པ་མ་ཡིན་ཏེ
en: he can use the power of his miraculous, extraordinary abilities in such a way that the light shining from a single pore of his body can illuminate as many worlds throughout the ten directions as there are grains of sand in the Ganges. Likewise, from a single pore of his body he can make the voice of Dharma heard in all those worlds. Such would not exhaust even a thousandth part of what can be displayed from a single pore.

source: དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡོན་ཏན་ལྷུན་གྱིས་གྲུབ་པའོ། །
en: The Thus-Gone One has spontaneously accomplished such unfathomable abilities as these.
